[
{
  "name": "菩提祖师",
  "type": "仙",
  "ability": "长生妙法、地煞七十二变、筋斗云、诸般神通、未卜先知、天罡三十六变",
  "introduction": "隐居在灵台方寸山斜月三星洞的得道高人，精通儒释道三家精髓，法力无边。他收孙悟空为徒，传授其长生之道、七十二般变化和筋斗云等神通。菩提祖师预知孙悟空将来会惹祸，在孙悟空学成后便要求他离开师门，并不准他提及师承来历。是一位深藏不露的世外高人。\n大觉金仙没垢姿，西方妙相祖菩提；不生不灭三三行，全气全神万万慈。空寂自然随变化，真如本性任为之；与天同寿庄严体，历劫明心大法师。",
  "organization": "",
  "superiors": {},
  "subordinates": {
    "孙悟空": "师徒"
  }
},
{
  "name": "唐僧",
  "type": "人",
  "ability": "紧箍咒、佛法感化、大乘佛法经文",
  "introduction": "本名陈玄奘，前世为如来佛祖座下二弟子金蝉子。转世为状元陈光蕊之子，自幼在金山寺出家为僧。他精通佛法，慈悲为怀，立誓前往西天大雷音寺求取大乘佛法三藏真经，以普渡众生，解救万民。唐太宗李世民与他结为兄弟，赐号'三藏'。虽然手无缚鸡之力，但凭借坚定的信念和高尚的品德，感化了四位本领高强的徒弟，最终带领团队克服九九八十一难，成功取得真经。",
  "organization": "",
  "superiors": {},
  "subordinates": {
    "孙悟空": "师徒",
    "猪八戒": "师徒",
    "沙僧": "师徒",
    "白龙马": "师徒"
  }
},
{
  "name": "孙悟空",
  "type": "仙",
  "ability": "地煞七十二变、筋斗云、火眼金睛、金刚不坏之身、法天象地、身外化身、呼风唤雨",
  "introduction": "号称齐天大圣，由东胜神洲傲来国花果山顶的仙石孕育而生。曾拜菩提祖师为师学得长生妙道，后大闹龙宫取得如意金箍棒，大闹地府勾销生死簿，大闹天宫力抗十万天兵。被如来佛祖镇压在五行山下五百年，经观音菩萨点化，保护唐僧西天取经。他机智勇敢，嫉恶如仇，是取经路上的核心战力，最终被封为斗战胜佛。",
  "organization": "",
  "superiors": {
    "菩提祖师": "师徒"
  },
  "subordinates": {
    "猪八戒": "师兄弟",
    "沙僧": "师兄弟",
    "白龙马": "师兄弟"
  }
},
{
  "name": "猪八戒",
  "type": "仙",
  "ability": "三十六变、腾云驾雾、九齿钉耙、水性精通、力大无穷",
  "introduction": "原为天庭掌管天河八万水军的天蓬元帅，因在王母娘娘的蟠桃会上醉酒调戏嫦娥，被玉帝贬下凡间，却错投猪胎。在高老庄为妖时强娶高小姐，后被孙悟空降服，受观音菩萨指点保护唐僧取经。他性格憨厚可爱，但好吃懒做，贪恋女色，经常闹着要分行李回高老庄，然而在关键时刻也能挺身而出，最终被封为净坛使者。",
  "organization": "",
  "superiors": {},
  "subordinates": {
    "沙僧": "师兄弟",
    "白龙马": "师兄弟"
  }
},
{
  "name": "沙僧",
  "type": "仙",
  "ability": "降妖宝杖、水性精通、力大无穷、忠诚可靠",
  "introduction": "原为天庭灵霄殿前的卷帘大将，因在蟠桃会上失手打碎琉璃盏，被玉帝贬下流沙河为妖，每七日受飞剑穿胸之苦。在流沙河吃人度日，后受观音菩萨点化，等候取经人。他性格忠厚老实，任劳任怨，一路上主要负责挑担行李，虽然话语不多，但始终坚定地守护在唐僧身边，是取经团队中最稳定的成员，最终被封为金身罗汉。",
  "organization": "",
  "superiors": {},
  "subordinates": {
    "白龙马": "师兄弟"
  }
},
{
  "name": "玉皇大帝",
  "type": "仙",
  "ability": "统御三界、掌管天道、敕封神位、制定天条",
  "introduction": "全称'昊天金阙无上至尊自然妙有弥罗至真玉皇上帝'，是三界最高统治者，居住在凌霄宝殿。他历经一千七百五十劫，每劫十二万九千六百年，修行圆满方登此尊位。执掌天庭政权，管辖天地人三界，统御诸天神佛，管理万物兴衰。在孙悟空大闹天宫时展现出极高的修为和定力，最终请来如来佛祖平息事端。\n 九天之上，谓之大罗。玉京金阙，云层峨峨。中有天帝，仁慈惠和。至道无敌，降伏众魔。天宝灵符，玉律金科。神仙亿万，幢幡众多。闻者罪灭，永出爱河。是号玉皇，穹苍真老。妙圆清净，智慧辩才，至道至尊。三界师，混元祖，无能胜主，四生慈父，高天上圣，大慈仁者。十号圆满，万德周身，无量度人，拨生死苦。",

  "organization": "天庭",
  "superiors": {
  },
  "subordinates": {
    "太上老君": "君臣",
    "太白金星": "君臣",
    "托塔李天王": "君臣",
    "哪吒": "君臣",
    "二郎神": "君臣",
    "孙悟空": "敌对转君臣"
  }
},
{
  "name": "王母娘娘",
  "type": "仙",
  "ability": "掌管蟠桃园、赐福增寿、主持蟠桃盛会",
  "introduction": "非玉皇大帝之妻，居住在瑶池。掌管天庭的蟠桃园，每千年举办一次蟠桃盛会，邀请各路神仙品尝蟠桃以增寿延年。她种的蟠桃分为三千年一熟、六千年一熟和九千年一熟三种，功效各不相同。",
  "organization": "天庭",
  "superiors": {
    "玉皇大帝": "君臣"
  },
  "subordinates": {
    "七仙女": "母女"
  }
},
{
  "name": "元始天尊",
  "type": "仙",
  "ability": "开天辟地、传授大道、掌控混沌、化生万物",
  "introduction": "三清之首，居住在玉清宫。道教最高神祇之一，象征宇宙本源与大道之始，传授原始大道给众仙和弟子，是道教的创始之尊。",
  "organization": "天庭",
  "superiors": {},
  "subordinates": {
    "十二金仙": "弟子"
  }
},
{
  "name": "灵宝天尊",
  "type": "仙",
  "ability": "传授符箓、掌控灵宝、度化众生、炼制法器",
  "introduction": "三清之二，居住在上清宫。主管道教的符箓法术和上清大道，象征灵性与宝藏，传授上清真诀，帮助众生悟道成仙。",
  "organization": "天庭",
  "superiors": {},
  "subordinates": {
    "上清弟子": "师徒"
  }
},
{
  "name": "太上老君",
  "type": "仙",
  "ability": "炼丹制药、炼制法宝、点石成金、一气化三清",
  "introduction": "道教始祖，居住在兜率宫。擅长炼制各种仙丹妙药和神器法宝，孙悟空的金箍棒、猪八戒的九齿钉耙等都出自他手。他的八卦炉炼出的仙丹能让人长生不老，孙悟空曾偷吃其仙丹练就金刚不坏之身。",
  "organization": "天庭",
  "superiors": {},
  "subordinates": {
    "金银童子": "师徒"
  }
},
{
  "name": "太白金星",
  "type": "仙",
  "ability": "斡旋调停、出谋划策、传达天旨",
  "introduction": "在《西游记》与中国神话故事中常常担任玉皇大帝的钦差大臣。是道教中掌管金星的星君，全称西方金德太白天皓星君，又称启明星君、长庚星君等。\n《史记正义》：“太白者，西方金之精，白帝之子，上公，大将军之像也。”\n阴阳家认为其是战神，掌管战争之事。只要金星在特殊时间、区域出现，是“变天”的象征，是暴发革命或政府变异的前兆，代表要发生大事了。\n《史记·天官书》曰：“当出不出，当入不入，是谓失舍，不有破军，必有国君之篡。”\n《汉书·天文志》：“太白经天，乃天下革，民更王。”唐代玄武门之变前，太史令傅奕曾密奏唐高祖：“太白见秦分，秦王当有天下。”秦王李世民登基之后，还不忘此事。",
  "organization": "天庭",
  "superiors": {
    "玉皇大帝": "君臣"
  },
  "subordinates": {}
},
{
  "name": "托塔李天王",
  "type": "仙",
  "ability": "统率天兵、降妖除魔、玲珑宝塔",
  "introduction": "天庭兵马大元帅，掌管十万天兵天将。手持玲珑宝塔，此塔能收服妖魔。每次天庭征讨妖魔时都由他挂帅出征，是玉帝最倚重的军事统帅。",
  "organization": "天庭",
  "superiors": {
    "玉皇大帝": "君臣"
  },
  "subordinates": {
    "哪吒": "父子",
    "金吒": "父子",
    "木吒": "父子"
  }
},
{
  "name": "哪吒",
  "type": "仙",
  "ability": "三头六臂、风火轮、火尖枪、乾坤圈、混天绫",
  "introduction": "托塔李天王第三子，师从太乙真人。曾大闹东海，后助周伐纣，肉身成圣。在天庭担任重要神职，常随父出征降妖，与孙悟空交手多次不分胜负。",
  "organization": "天庭",
  "superiors": {
    "玉皇大帝": "君臣",
    "太乙真人": "师徒"
  },
  "subordinates": {}
},
{
  "name": "二郎神",
  "type": "仙",
  "ability": "七十二变、三尖两刃刀、天眼、哮天犬",
  "introduction": "玉皇大帝的外甥，居住在灌江口。拥有天眼能识破一切变化，与孙悟空一样精通七十二变。曾与孙悟空大战三百回合不分胜负，最终在太上老君帮助下擒获孙悟空。虽为天庭效力但听调不听宣，保持相对独立性。",
  "organization": "天庭",
  "superiors": {
    "玉皇大帝": "君臣"
  },
  "subordinates": {
    "孙悟空": "对手"
  }
},
{
  "name": "如来佛祖",
  "type": "仙",
  "ability": "无边佛法、掌中佛国、慧眼观三界",
  "introduction": "西方极乐世界教主，法力无边。在孙悟空大闹天宫时受邀前来降妖，用一掌化作五行山将孙悟空镇压五百年。后来策划并支持唐僧西天取经，是取经计划的最高策划者。",
  "organization": "佛教",
  "superiors": {},
  "subordinates": {
    "观音菩萨": "同事",
    "孙悟空": "点化"
  }
},
{
"name": "金银童子",
"type": "仙",
"ability": "服侍炼丹、守护兜率宫、辅助炼制法宝、传授仙术基础",
"introduction": "金银童子是道教神话中太上老君的两位贴身童子，分别名为金童和银童，他们是天庭兜率宫中的侍者，常伴老君左右，负责日常服侍、打理炼丹炉和守护宫殿安全。在《西游记》中，金银童子首次出现于孙悟空偷吃仙丹的情节中，当时孙悟空化作苍蝇飞入兜率宫，偷食了老君炼制的金丹，而金银童子虽在旁侍奉，却未能察觉孙悟空的诡计，导致老君的仙丹被盗一空。这次事件后，老君虽未责罚童子，但凸显了他们在神话故事中的辅助角色。他们身着金银色道袍，手持拂尘，形象俊美灵动，象征纯洁与忠诚。作为老君的近侍，他们偶尔也会参与简单的炼丹辅助工作，如添柴、扇风或传递药材，虽然不具备老君那般炼丹制药的绝顶神通，但他们对仙丹配方和基本炼器之道了如指掌，常被老君派往人间或天庭传递丹药或执行小任务。在道教文化中，金银童子代表阴阳调和、金银不朽的寓意，常出现在道教符箓和壁画中，作为护法童子的形象，祈求长生与财富。传说中，他们本是天界灵气所化，非凡人转世，故而永葆童颜，法力虽不强，但拥有基本的腾云驾雾和隐身之术，能在老君的八卦炉旁自由出入而不受高温侵扰。金银童子与老君的关系如师徒般亲密，老君视他们为左膀右臂，他们则以绝对忠诚回报，常在老君闭关炼丹时独守宫门，防范外敌入侵。在更广泛的民间传说中，金银童子有时被赋予点化凡人的角色，帮助有缘人获得小许仙缘，但始终以侍奉老君为首要职责，他们的出现往往预示着吉祥与机缘。",
"organization": "天庭",
"superiors": {
"太上老君": "师徒"
},
"subordinates": {}
},
{
"name": "金吒",
"type": "仙",
"ability": "掌中佛国、火焰神通、降妖宝剑、护法金刚、诵经禅定",
"introduction": "金吒，全名金吒太子，是托塔天王李靖的长子，在中国神话尤其是《封神演义》和《西游记》相关传说中扮演重要角色。他本是人间李靖与夫人殷氏之子，自幼聪慧过人，资质上乘，早年随父征战人间，后拜燃灯道人为师，修习佛教密法，成就护法神通。在《封神演义》中，金吒因与兄弟哪吒的家庭纷争而离家出走，途中遇燃灯道人点化，赐予他一柄宝剑和火焰神通，使其在伐纣之战中屡立战功，如在万仙阵中以掌中佛国收服敌将，展现出佛道合一的强大法力。他性格刚正不阿，忠孝两全，虽与父李靖曾有隔阂，但最终化解恩怨，成为天庭忠臣。修成正果后，金吒被封为托塔天王座下大将，常驻天庭，辅佐父兄镇守南天门，专司火部之事，能操控烈焰焚烧妖邪，护佑人间免遭火劫。在《西游记》衍生传说中，金吒偶尔随父出征，助孙悟空等降妖，与二弟哪吒并肩作战，兄弟三人各司其职：哪吒主风火，金吒主烈焰，木吒主禅定，形成天庭军事上的铁三角。他的神通包括掌中佛国——一掌可化作小世界，困敌于其中；火焰剑能喷吐三昧真火，焚烧万物；此外，他精通诵经禅定，能以佛光镇压邪祟，化解怨气。作为李靖长子，金吒在家族中担负长兄责任，常调解兄弟间矛盾，体现出稳重与智慧。在道教与佛教融合的文化中，金吒象征忠诚与守护，常被供奉在寺庙中，作为护法天尊的化身，祈求家庭和睦与事业顺利。传说中，他曾下凡度化凡人，传授防火避灾的法门，使无数信众受益，其形象多为手持宝剑、身披金甲的英武少年，永葆青春，法力深厚。",
"organization": "天庭",
"superiors": {
"玉皇大帝": "君臣",
"托塔李天王": "父子"
},
"subordinates": {}
},
{
"name": "木吒",
"type": "仙",
"ability": "禅定神通、木行法术、宝瓶洒水、化形木偶、静心护法",
"introduction": "木吒，全名木吒太子，是托塔天王李靖的次子，在《封神演义》和相关神话传说中以智慧与禅定著称。他与兄长金吒、弟弟哪吒同为李靖之子，自幼随父习武，但性情温和，不喜杀伐，早年离家拜文殊菩萨为师，修习禅定与木行之道，成就菩萨座下童子之位。在《封神演义》中，木吒因家庭变故而出走，途中得文殊菩萨点化，赐予他一柄宝瓶，能洒出甘露化解兵戈，使其在战场上以柔克刚，如在十绝阵中以禅定之力平息杀气，助周武王大军克敌。他的神通以静制动为主，能入定不动如山，操控木灵化作藤蔓缠敌或木偶分身迷惑对手，象征生机与守护。在天庭中，木吒被封为增长天王座下护法，驻守兜率宫外，常与兄弟协力镇压妖魔，虽不似哪吒那般勇猛，却以智慧化解危局。在《西游记》传说中，木吒偶尔现身取经路上，助唐僧一行渡过心魔劫难，以宝瓶洒水洗涤尘埃，帮助孙悟空等恢复清明。他的性格沉稳内敛，孝顺仁慈，曾多次调解父子兄弟间的恩怨，推动家族和睦。作为文殊菩萨的弟子，木吒精通佛法，能以一念静心，破除幻境，护佑修行者免遭心猿意马之扰。在民间信仰中，木吒被视为文昌帝君的辅佐，祈求学业有成与心智平和，其形象多为手持宝瓶、身着青袍的文雅童子，永驻天界，法力温和却深不可测。传说中，他曾下凡化身为书生，传授禅理与木工巧术，造福人间，体现出神话中柔和一面的守护神。",
"organization": "天庭",
"superiors": {
"玉皇大帝": "君臣",
"托塔李天王": "父子",
"文殊菩萨": "师徒"
},
"subordinates": {}
},

{
  "name": "观音菩萨",
  "type": "仙",
  "ability": "大慈大悲、千手千眼、净瓶杨柳、普度众生、化身万千、耳根圆通、降妖伏魔、感应祈愿",
  "introduction": "观音菩萨，全称观世音菩萨，又名观自在菩萨，是佛教中慈悲的化身，居住在南海紫竹林普陀落伽山。她本是古佛释迦牟尼的弟子阿鞞跋致尊者转世，因其慈悲愿力宏大，誓愿普度众生而成就菩萨果位。在《西游记》中，观音菩萨扮演关键角色，她奉如来佛祖之命，寻找取经人选，先点化孙悟空脱困五行山，赐以金箍棒和紧箍咒以约束其野性；随后寻得猪八戒、沙僧、白龙马等徒弟，组成取经团队，护佑唐僧西行九九八十一难。她以千手千眼神通，能同时救度无数众生，手持净瓶杨柳枝，能洒甘露灭火消灾，化身为各种形象如慈航真人或鱼篮观音，潜入凡间度化有缘人。观音菩萨的耳根圆通神通，使她能听到世间一切苦难呼声，第一时间施以援手，在神话传说中，她曾救苦救难无数，如助刘阮遇仙女、度化多宝道人等。她的慈悲不分种族，不问善恶，一视同仁，常以柔和之力化解刚猛之灾，如在火焰山以借芭蕉扇平息烈焰。在道教与佛教融合的文化中，观音菩萨被尊为大士，常现身民间信仰中，祈求平安与子嗣，其形象多为白衣飘飘、手持净瓶的温柔女子，永驻南海，法力无边。传说中，她曾下凡化身为凡人，体验人间疾苦，以此深化慈悲之心，其普度众生的宏愿贯穿三界六道，无时无刻不在守护弱小与迷途者。",
  "organization": "佛教",
  "superiors": {},
  "subordinates": {
    "惠岸": "童子",
    "孙悟空": "点化",
    "猪八戒": "点化",
    "沙僧": "点化",
    "白龙马": "点化"
  }
},
{
  "name": "文殊菩萨",
  "type": "仙",
  "ability": "大智若愚、狮子吼、智慧剑、降龙伏虎、普贤骑象、文殊台、辩才无碍、启迪慧根",
  "introduction": "文殊菩萨，全称文殊师利菩萨，是佛教智慧的象征，居住在五台山清凉界，又称曼殊室利菩萨。她本是东方琉璃净土的古佛转世，以大智慧闻名于三界，能以狮子吼震慑邪魔，启迪众生慧根。在《西游记》中，文殊菩萨以金毛狮子为坐骑，曾因狮子下山食人而降伏之，后借给唐僧师徒作为坐骑，助其渡过险阻；此外，他点化木吒为童子，助其修成正果，体现师徒传承的深厚情谊。文殊菩萨手持智慧剑，能斩断无明妄念，骑乘青狮，象征智慧降伏愚痴；在神话传说中，他常与普贤菩萨并称文殊普贤，共同守护五台山与峨眉山，一主智慧一主行愿，互补相成。他曾下凡化身为文殊台上的老僧，度化无数求道者，以辩才无碍的口才破除疑障，使听者豁然开朗。在佛教经典如《华严经》中，文殊菩萨是释迦牟尼的左胁侍，常宣讲深奥佛理，帮助菩萨们证悟空性。他的神通包括普照慧光，能令黑暗愚昧之地生起明灯，启发孩童天资或迷途智者重拾正见。在民间信仰中，文殊菩萨被尊为文昌星君的化身，祈求学业有成与智慧增长，其形象多为少年相貌、手持宝剑或经卷的俊逸菩萨，永驻清凉世界，法力以柔和智慧化解一切刚猛冲突。传说中，他曾与弟子木吒游历人间，传授禅机与诗词，使无数文人受益，其大智若愚的境界，成为修行者永世追寻的典范。",
  "organization": "佛教",
  "superiors": {},
  "subordinates": {
    "木吒": "童子",
    "金毛狮子": "坐骑"
  }
},
{
  "name": "普贤菩萨",
  "type": "仙",
  "ability": "大行愿王、六牙白象、毗卢顶、摩顶受记、普贤行海、加持愿力、护法庄严、利益众生",
  "introduction": "普贤菩萨，全称普贤尊王菩萨，是佛教行愿的象征，居住在峨眉山金顶，又称大行普贤菩萨。她本是南方欢喜净土的古佛转世，以十大愿王闻名于世，能以无尽愿力加持众生实践佛行。在《西游记》中，普贤菩萨以六牙白象为坐骑，曾因象下山扰民而降伏之，后借给唐僧师徒作为代步，助其穿越险峻山路；他点化李靖之子木吒为童子，助其成就护法之道，体现菩萨的慈悲度化。普贤菩萨手持如意宝珠或莲花，骑乘白象，象征行愿广大、无碍自在；在神话传说中，他与文殊菩萨并称，共同宣讲《华严经》，一主行愿一主智慧，互为表里，帮助菩萨摩诃萨证入菩提。他曾下凡化身为峨眉山上的老者，引导香客参禅，以摩顶受记的神通赐予信众长寿与福报，使其一生行善不退。在佛教经典中，普贤菩萨是释迦牟尼的右胁侍，常以毗卢顶放光普照，利益十方世界。他的神通包括普贤行海，能令愿力如海浪般涌动，护佑修行者不离正道，庄严佛土。在民间信仰中，普贤菩萨被尊为行愿之王，祈求事业顺利与家庭和睦，其形象多为威严菩萨、足踏白象、手持莲花的庄严相，永驻金顶，法力以广大愿力感化顽劣之心。传说中，他曾与弟子金吒游历尘世，传授布施与忍辱的妙法，使无数苦行者得解脱，其十大愿王的誓言——礼敬诸佛、称赞如来等，成为大乘佛教的核心实践指南。",
  "organization": "佛教",
  "superiors": {},
  "subordinates": {
    "金吒": "童子",
    "六牙白象": "坐骑"
  }
},
{
  "name": "地藏菩萨",
  "type": "仙",
  "ability": "地狱不空、誓不成佛、普度幽冥、十王经、持锡杖、明珠照路、救苦拔罪、感应冥府",
  "introduction": "地藏菩萨，全称地藏王菩萨，又名大愿地藏菩萨，是佛教中地狱救度的象征，居住在九华山地藏洞，又称光明普照菩萨。她本是古佛净月天子转世，因其宏愿——地狱不空，誓不成佛，而永驻幽冥世界，度化无边罪苦众生。在《西游记》中，地藏菩萨虽未直接现身取经路上，但其影响深远，如在冥府情节中，孙悟空勾销生死簿时，地藏菩萨的冥界法力隐现，守护轮回公正；此外，他常被提及为六道中地狱的守护者，助观音菩萨普度六道。在神话传说中，地藏菩萨手持锡杖敲击地狱铁门，释放囚徒，明珠照亮幽暗冥途，能以一念之力拔罪超生，化解业障。他曾下凡化身为九华山上的僧人，度化猎户与罪人，以《地藏经》宣讲因果报应，使听者悔过自新，脱离苦海。在佛教经典如《地藏菩萨本愿经》中，他是释迦牟尼的嘱托者，誓愿入地狱如入自家，教化饿鬼、地狱众生，乃至畜生道。他的神通包括感应冥府，能听到幽冥呼救，瞬息而至施救，护佑孝子或善人免堕恶道。在民间信仰中，地藏菩萨被尊为幽冥教主，祈求亡灵超度与现世平安，其形象多为持锡杖、明珠的庄严僧相，永镇地狱，法力以悲愿之力穿透六道轮回。传说中，他曾与弟子金刚童子游走冥界，传授忏悔与持戒的法门，使无数灵魂得解脱，其大愿宏深，成为中阴身与丧葬仪式的精神支柱。",
  "organization": "佛教",
  "superiors": {},
  "subordinates": {
    "谛听": "坐骑"
  }
},
{
"name": "金毛犼",
"type": "仙",
"ability": "腾云驾雾、吞吐风云、守护菩萨、辨别善恶、喷雾灭火、啸聚群兽",
"introduction": "金毛犼，又称朝天犼、望天犼或蹬龙，是观音菩萨的坐骑，在佛教神话中象征慈悲守护与威猛护法。它本是龙王第九子，因性情暴烈而被逐出龙宫，后被观音菩萨以大慈悲之力降伏，收为坐骑，永伴菩萨左右。在《西游记》中，金毛犼曾下界为狮驼岭的金毛狮王，化身为妖王，统领狮驼洞，吞食无数生灵，险些吞噬唐僧肉以求长生，但最终被孙悟空等师徒降服，显露原形，返回观音身边接受惩戒。这次事件凸显了其凶猛本性与菩萨调教的慈悲对比。金毛犼外形似狮非狮，头如龙首，全身金毛闪耀，能腾云驾雾，瞬息千里；其啸声可啸聚百兽，喷吐云雾能灭火消灾，辨别善恶之心如明镜，能助菩萨感应世间苦难。传说中，金毛犼是观音菩萨的四宝之一（另三为净瓶、莲花、杨柳枝），常现身南海紫竹林，守护落伽山，防范妖魔入侵。它曾多次下凡助菩萨普度众生，如在人间化身为金毛犬，守护善信免遭灾厄；在佛教经典如《观音经》中，它象征菩萨的护法之力，能以一吼震慑邪祟，护佑信众平安。作为龙裔神兽，金毛犼融合龙狮之威，永葆青春不老，法力虽强却受菩萨慈悲约束，不再肆虐人间。在民间信仰中，金毛犼被视为辟邪护宅的瑞兽，常出现在寺庙雕像中，祈求家庭和睦与事业顺遂，其形象多为金毛狮龙合体、头仰天吼的威猛姿态，永驻菩萨座下，彰显慈悲与威严的完美统一。",
"organization": "佛教",
"superiors": {
"观音菩萨": "坐骑"
},
"subordinates": {}
},
{
"name": "青狮",
"type": "仙",
"ability": "七十二变、吞剑吐火、啸聚妖众、辨识真伪、腾云驾雾、狮吼震天",
"introduction": "青狮，又称金毛狮子或乌鸡狮猁王，是文殊菩萨的坐骑，在佛教神话中象征智慧降伏愚痴与王者之威。它本是西方极乐世界的灵兽，因贪食人间而下界为狮驼岭的青毛狮妖，统领狮驼洞，吞噬无数僧人，险些吃掉唐僧以求成仙，但在《西游记》中被孙悟空大战三百回合后败北，显露原形，被文殊菩萨收回，永为坐骑。这次下界事件体现了其兽性与菩萨智慧的调和。青狮外形威猛，青毛金睛，能施展七十二般变化，吞剑吐火，啸声如狮吼震天，能聚散妖众；其神通包括辨识真伪，一眼洞察幻术，助文殊菩萨斩断无明妄念。传说中，青狮是文殊菩萨的狮子吼化身，常骑乘于五台山清凉界，守护文殊台，防范魔障入侵。它曾助菩萨下凡度化愚痴众生，如化身为山中猛兽，考验求道者的心志；在佛教经典如《华严经》中，青狮象征智慧之王，能以一跃跨越虚空，普照慧光。修成正果后，青狮永伴文殊，不再下界作乱，法力深厚却以忠诚著称。在民间信仰中，青狮被视为文昌护法，常供奉于书斋，祈求智慧增长与考试顺利，其形象多为青毛巨狮、口衔宝珠的雄壮姿态，永驻菩萨座下，彰显大智若愚的境界。作为百兽之王，青狮的出现往往预示智慧启迪与邪祟退散，成为修行者心中的守护象征。",
"organization": "佛教",
"superiors": {
"文殊菩萨": "坐骑"
},
"subordinates": {}
},
{
"name": "白象",
"type": "仙",
"ability": "腾云驾雾、喷水化雨、背负菩萨、稳如泰山、辟邪护法、长鼻卷敌",
"introduction": "白象，又称六牙白象，是普贤菩萨的坐骑，在佛教神话中象征广大行愿与稳固不移。它本是南方欢喜净土的瑞兽，因好奇人间而下界为狮驼岭的白象精，统领狮驼洞，吞食僧众，企图食唐僧肉求长生，但在《西游记》中被孙悟空等击败，显露原形，被普贤菩萨收回，永为坐骑。这次下界作妖凸显了其强大力量与菩萨愿力的感化。白象外形庄严，六牙如剑，全身雪白，能腾云驾雾，喷水化雨，长鼻可卷敌擒魔；其神通包括稳如泰山，能背负菩萨穿越虚空，辟邪护法，一踏足震慑妖氛。传说中，白象是普贤菩萨的十大愿王化身，常骑乘于峨眉山金顶，守护普贤行海，助菩萨摩顶受记，赐福信众。它曾多次下凡助菩萨实践行愿，如化身为山中巨象，载运香客登高参禅；在佛教经典如《华严经》中，白象象征无碍自在，能以一步跨越三千世界，利益众生。修成正果后，白象永伴普贤，法力以愿力加持，不再扰乱人间。在民间信仰中，白象被视为吉祥瑞兽，常出现在寺庙壁画中，祈求事业稳健与长寿安康，其形象多为六牙白象、背负菩萨的宏伟姿态，永驻金顶，彰显大行普贤的庄严。作为瑞兽之首，白象的出现往往预示愿力成就与福报临门，成为大乘行者的精神支柱。",
"organization": "佛教",
"superiors": {
"普贤菩萨": "坐骑"
},
"subordinates": {}
},
{
"name": "谛听",
"type": "仙",
"ability": "耳聪目明、洞察过去未来、辨别真伪、善听万物、瞬息千里、护法幽冥",
"introduction": "谛听，又称谛听兽或善听，是地藏菩萨的坐骑，在佛教神话中象征地狱救度与洞察无遗。它本是幽冥世界的灵兽，耳如象耳、目如豺目、身如麒麟、足如马蹄、四不像之姿，从不曾下界为妖作乱，而是忠心守护地藏菩萨，永驻九华山地藏洞，助菩萨普度六道众生。在《西游记》中，谛听现身于真假美猴王一回，助如来佛祖辨识孙悟空真伪，一耳听遍三界，一目洞察过去未来，神通盖世，却不需战斗，仅以智慧化解纷争。这次事件凸显了其独特地位——四大菩萨坐骑中唯一未下界为妖者，体现了其纯净本性与菩萨大愿的契合。谛听能善听万物声音，通晓因果业报，瞬息千里巡视冥府，护佑亡灵超度；其神通包括辨别真伪，一瞬识破幻术，助地藏菩萨敲击锡杖，释放地狱囚徒。传说中，谛听是地藏菩萨的耳目化身，常伴菩萨入地狱如入自家，照亮幽暗冥途，化解怨气。在佛教经典如《地藏经》中，谛听象征感应冥府，能听到幽冥呼救，瞬息施援，护佑孝子善人免堕恶道。永不作乱的谛听法力深厚，以忠诚与智慧著称。在民间信仰中，谛听被视为阴阳调和的瑞兽，常供奉于丧葬仪式，祈求亡灵安宁与现世平安，其形象多为四不像、四耳四目的奇异神兽，永镇地狱，彰显地狱不空誓不成佛的宏愿。作为冥界守护者，谛听的出现往往预示业障消解与超生机缘，成为中阴身与忏悔者的永恒伴侣。",
"organization": "佛教",
"superiors": {
"地藏菩萨": "坐骑"
},
"subordinates": {}
},
  {
"name": "牛魔王",
"type": "妖",
"ability": "法力高強，能變化形貌，坐騎為璧水金睛獸",
"introduction": "住在積雷山摩雲洞，為孫悟空等六魔王結拜大哥，自號平天大聖。妻子為鐵扇公主，育有子紅孩兒。與鐵扇公主爭芭蕉扇時與孫悟空交戰，被哪吒帶回天庭聽候發落。",
"organization": "積雷山",
"superiors": {},
"subordinates": {
  "红孩儿": "父子",
  "孙悟空": "结拜兄弟"
     }
},

{
"name": "红孩儿",
"type": "妖",
"ability": "能吐三昧真火",
"introduction": "牛魔王與鐵扇公主之子，自稱聖嬰大王，為孫悟空義姪。捉走唐三藏，與孫悟空大戰，被觀音菩薩用寶刀化蓮花寶座收服，改名善財童子。",
"organization": "積雷山",
"superiors": {
"牛魔王": "父",
"铁扇公主": "母"
},
"subordinates": {}
},

{
"name": "铁扇公主",
"type": "妖",
"ability": "持有芭蕉扇，能滅火焰山之火",
"introduction": "牛魔王之妻，持芭蕉扇。孫悟空借扇不成就鑽入她腹中大鬧，後被騙得假扇，再變牛魔王模樣騙得真扇。",
"organization": "積雷山",
"superiors": {},
"subordinates": {
"红孩儿": "母"
}
},

{
"name": "弥勒佛",
"type": "仙",
"ability": "掌管小雷音寺，收伏黃眉大王",
"introduction": "東來佛祖，收伏小雷音寺的黃眉怪。黃眉大王原為其童子，下凡為妖，偷人種袋和金鐃，被孫悟空吸引後吃下假瓜，折騰於腹中投降，彌勒佛帶回。",
"organization": "佛教",
"superiors": {},
"subordinates": {
"黃眉大王": "师徒"
}
},

{
"name": "大鹏金翅雕",
"type": "妖",
"ability": "擁有陰陽二氣瓶，飛行迅速，搧翅九萬里",
"introduction": "孔雀明王之兄弟，霸佔獅駝國，吃盡百姓，欲吃唐僧肉。與青毛獅子、黃牙老象結義對付孫悟空，被如來收回，抽筋不得飛翔。",
"organization": "獅駝洞",
"superiors": {},
"subordinates": {}
}
]
